mxyxbb/STM32G474-BUCK-Converter/docs/B-G474-DPOW1-20200420/Buck_CurrentMode_SW/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "../../common/STM32G474RE_Discovery.c"
#include "stm32g4xx_it.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
//#define RUN_OPEN_LOOP
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

COMP_HandleTypeDef hcomp6;

DAC_HandleTypeDef hdac4;

FMAC_HandleTypeDef hfmac;

HRTIM_HandleTypeDef hhrtim1;

OPAMP_HandleTypeDef hopamp5;

RTC_HandleTypeDef hrtc;

/* USER CODE BEGIN PV */
float Vdrop = SLOPE_VPP;
float Vdrop_old = 0.0;
extern G4_Demo_t Demo;
int16_t bTransient = 0;
int32_t Vout;
int32_t CompareReg;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_RTC_Init(void);
static void MX_ADC1_Init(void);
static void MX_HRTIM1_Init(void);
static void MX_FMAC_Init(void);
static void MX_COMP6_Init(void);
static void MX_DAC4_Init(void);
static void MX_OPAMP5_Init(void);
/* USER CODE BEGIN PFP */
extern uint16_t HAL_HRTIM_NsToTicks(HRTIM_HandleTypeDef *hhrtim, uint32_t Timers, int ns);
extern uint16_t HAL_HRTIM_FreqToTicks(HRTIM_HandleTypeDef *hhrtim, uint32_t Timers, int FreqHz);
extern uint16_t HAL_HRTIM_DeadBandNsToTicks(int ns);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE BEGIN 0 */
/**
  * @brief This function handles the loads.
  */
void LoadHandler(void)
{
  switch (Demo.NbrActiveLoad)
  {
  case 2:
    /* Enable Load_1 */
    HAL_GPIO_WritePin(GPIOC, BUCKBOOST_LOAD_1_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(GPIOB, LED_RIGHT_GREEN_Pin, GPIO_PIN_SET);    
    /* Enable Load_2 */
    HAL_GPIO_WritePin(GPIOC, BUCKBOOST_LOAD_2_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(GPIOB, LED_LEFT_ORANGE_Pin, GPIO_PIN_SET);
    break;
  case 1:
    /* Enable Load_1 */
    HAL_GPIO_WritePin(GPIOC, BUCKBOOST_LOAD_1_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(GPIOB, LED_RIGHT_GREEN_Pin, GPIO_PIN_SET);
    /* Disable Load_2 */
    HAL_GPIO_WritePin(GPIOC, BUCKBOOST_LOAD_2_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(GPIOB, LED_LEFT_ORANGE_Pin, GPIO_PIN_RESET);
    break;
  case 0:
  default:
    /* Disable Load_1 */
    HAL_GPIO_WritePin(GPIOC, BUCKBOOST_LOAD_1_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(GPIOB, LED_RIGHT_GREEN_Pin, GPIO_PIN_RESET);
    /* Disable Load_2 */    
    HAL_GPIO_WritePin(GPIOC, BUCKBOOST_LOAD_2_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(GPIOB, LED_LEFT_ORANGE_Pin, GPIO_PIN_RESET);
    break;
  }
}

/**
  * @brief This function handles System tick timer.
  */
void SysTick_Handler(void)
{
  /* USER CODE BEGIN SysTick_IRQn 0 */
  
  // If ~512 ms has elapsed, check if we are doing transient load mode
  // and run the load handler
  if (0 == HAL_GetTick() % 512)
  {
    if (Demo.bTransient == 1)
    {
      if (Demo.NbrActiveLoad == 1)
      {
        Demo.NbrActiveLoad = 2;
      }
      else 
      {
        Demo.NbrActiveLoad = 1;
      }     
      
      LoadHandler();
    }
  }
  
  // Play back data captured during FMAC ISR
  WaveFormDisplay(&Vout, &CompareReg);    

  /* USER CODE END SysTick_IRQn 0 */
  HAL_IncTick();
  /* USER CODE BEGIN SysTick_IRQn 1 */

  /* USER CODE END SysTick_IRQn 1 */
}

/**
  * @brief This set the slope for the DAC.
  * @details
  * The sets the total drop across the PWM period required.
  * We use DAC1 channel 1&2 since channel 1 is connected to the external pin
  * but channel 2 is actually used for the controller.
  */
void SetRamp( float SlopeV )
{
  uint16_t update;
  float stepV;
  uint16_t step;
  uint16_t NumUpdates = 75; // Max updates per period is determiend by the max update rate of the DAC
  
  update = Demo.periodBuck / NumUpdates;
  stepV = SlopeV/NumUpdates;
  
  /* DacDrop = (Vdrop * 4096*16(fractional)/3.3V) */
  step = (uint16_t)((stepV * DAC_MAX * 16)/3.3);
  
  /* Update the sawtooth waveform generator with the required step size */
  LL_DAC_SetWaveSawtoothStepData(DAC4, LL_DAC_CHANNEL_2, step);
  __HAL_HRTIM_SETCOMPARE( &hhrtim1, HRTIM_TIMERINDEX_TIMER_C, HRTIM_COMPAREUNIT_2, update);
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */
  

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

